app/controllers/tickets_controller.rb

SELECT "tickets".* FROM "tickets" INNER JOIN "customers" ON "customers"."id" = "tickets"."customer_id" WHERE (customers.phone_number = '0981599938') ORDER BY "tickets"."created_at" DESC
---
  def index
    return unless params[:id].present? && params[:phone_number].present?
    @tickets = Ticket.join_customer.search_ticket(params[:id],
      params[:phone_number]).first