app/controllers/tickets_controller.rb

  def search_all_tickets
    return unless params[:phone_number].present?
    @tickets = Ticket.join_customer.search_ticket(nil, params[:phone_number]).sorted

    if @tickets.blank?
---
SELECT "tickets".* FROM "tickets" INNER JOIN "customers" ON "customers"."id" = "tickets"."customer_id" WHERE (customers.phone_number = '0981599938') ORDER BY "tickets"."created_at" DESC